Revit 2027 API
GuidEnum.Equals Method
 Compares two Guid-based enum object based on their concrete class and GUID value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
public:
virtual bool Equals(
	Object^ obj
) override
abstract Equals :
        obj : Object -> bool
override Equals :
        obj : Object -> bool
Parameters
obj Object
Return Value
Boolean
See Also
Reference
GuidEnum Class
Autodesk.Revit.DB Namespace